Infineon/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Qspi.c
/**********************************************************************************************************************
 * \file    Qspi.c
 * \copyright Copyright (C) Infineon Technologies AG 2023
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG or its licensees. If and as long as no such terms of use
 * are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization obtaining a copy of the software and
 * accompanying documentation covered by this license (the "Software") to use, reproduce, display, distribute, execute,
 * and transmit the Software, and to prepare derivative works of the Software, and to permit third-parties to whom the
 * Software is furnished to do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including the above license grant, this restriction
 * and the following disclaimer, must be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are solely in the form of
 * machine-executable object code generated by a source language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
 * WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN
 * CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * IN THE SOFTWARE.
 *********************************************************************************************************************/


/*********************************************************************************************************************/
/*-----------------------------------------------------Includes------------------------------------------------------*/
/*********************************************************************************************************************/
#include "IfxPort.h"
#include "IfxQspi_SpiMaster.h"
#include "IfxSrc_cfg.h"
#include "Platform_Types.h"
#include "Qspi.h"
#include "SpiIf.h"
#include "TLE9180.h"

/*********************************************************************************************************************/
/*-------------------------------------------------Global variables--------------------------------------------------*/
/*********************************************************************************************************************/
QspiCommunication g_qspi;
/*********************************************************************************************************************/
/*--------------------------------------------Private Variables/Constants--------------------------------------------*/
/*********************************************************************************************************************/

/*********************************************************************************************************************/
/*------------------------------------------------Function Prototypes------------------------------------------------*/
/*********************************************************************************************************************/

/*********************************************************************************************************************/
/*---------------------------------------------Function Implementations----------------------------------------------*/
/*********************************************************************************************************************/
void Qspi_initQspi(QspiCommunication* const qspiCommunication)
{
    {
        /* create SPI0 module config */
        static IfxQspi_SpiMaster_Config        spiConfig;                       /* Define the Master Configuration          */
        IfxQspi_SpiMaster_initModuleConfig(&spiConfig, &SPI_3_MODULE);

        /* pin configuration */
        const IfxQspi_SpiMaster_Pins spiPins =
        {
                &SPI_3_CLOCK_PIN,  IfxPort_OutputMode_pushPull,          /* SCLK Pin                          (CLK)  */
                &SPI_3_MOSI_PIN,  IfxPort_OutputMode_pushPull,           /* Master Transmit Slave Receive Pin (MOSI) */
                &SPI_3_MISO_PIN,  IfxPort_InputMode_pullDown,            /* Master Receive Slave Transmit Pin (MISO) */
                IfxPort_PadDriver_cmosAutomotiveSpeed3                   /* Pad driver mode                          */
        };
        spiConfig.pins = &spiPins;                                       /* Assign Master Pins                       */
        /* set the maximum baudrate */
        spiConfig.maximumBaudrate = 50.0e6;

        /* ISR priorities and interrupt target */
        spiConfig.txPriority    = INTERRUPT_PRIORITY_QSPI3_TX;
        spiConfig.rxPriority    = INTERRUPT_PRIORITY_QSPI3_RX;
        spiConfig.erPriority    = INTERRUPT_PRIORITY_QSPI3_ERR;
        spiConfig.isrProvider   = SPI_3_HOST_CPU;
        spiConfig.vmId          = IfxSrc_VmId_0;
#if (SPI_3_USE_DMA == TRUE)
        spiConfig.dma.txDmaChannelId = SPI_3_TX_DMA_CH;
        spiConfig.dma.rxDmaChannelId = SPI_3_RX_DMA_CH;
        spiConfig.dma.useDma         = TRUE;
#endif
        /* initialize module */
        IfxQspi_SpiMaster_initModule(&qspiCommunication->spiMasterQspi3tle9180, &spiConfig);
    }

    {
        static IfxTLE9180_Config tleConfig;

        /* Configure SPI Channels for Motor Control Module */
        /* Configuration for TLE9180 communication         */
        /* create channel config */
        static IfxQspi_SpiMaster_ChannelConfig spiChConfig;
        IfxQspi_SpiMaster_initChannelConfig(&spiChConfig, &qspiCommunication->spiMasterQspi3tle9180);

        /* set the baudrate for this channel */
        spiChConfig.ch.baudrate = IFX_TLE9180_BAUDRATE;

        /* set the transfer data width */
        spiChConfig.ch.mode.dataWidth = IFX_TLE9180_DATAWIDTH;

        spiChConfig.ch.mode.csTrailDelay      = SpiIf_SlsoTiming_1;
        spiChConfig.ch.mode.csInactiveDelay   = SpiIf_SlsoTiming_7;
        spiChConfig.ch.mode.shiftClock        = SpiIf_ShiftClock_shiftTransmitDataOnTrailingEdge;

        spiChConfig.sls.output.pin    = &SPI_3_CS_PIN;
        spiChConfig.sls.output.mode   = IfxPort_OutputMode_pushPull;
        spiChConfig.sls.output.driver = IfxPort_PadDriver_cmosAutomotiveSpeed1;

        spiChConfig.channelBasedCs= IfxQspi_SpiMaster_ChannelBasedCs_enabled;

        /* initialize channel */
        IfxQspi_SpiMaster_initChannel(&qspiCommunication->spiChannelQspi3tle9180, &spiChConfig);

        tleConfig.size = 8192;

        tleConfig.pins.enable   = TLE9180_ENABLE_PIN;
        tleConfig.pins.error    = TLE9180_ERROR_PIN;
        tleConfig.pins.inhibit  = TLE9180_INHIBIT_PIN;
        tleConfig.pins.safeOff  = TLE9180_SAFEOFF_PIN;

        tleConfig.spiChannel = &qspiCommunication->spiChannelQspi3tle9180;

        /*Configure the SPI interfaces as QSPI Master Interfaces*/
        tleConfig.spiIf.spiExchange= (IfxTLE9180_SpiExchangeIfPtrType)&IfxQspi_SpiMaster_exchange;

        IfxTLE9180_init(&qspiCommunication->driverTle9180, &tleConfig);
    }
}

#if (INTERRUPT_PRIORITY_QSPI3_TX > 0)
/* Interrupt service units for QSPI3 Transmit
 *
 */
IFX_INTERRUPT(Qspi_Tle9180_TxIsr, 0, INTERRUPT_PRIORITY_QSPI3_TX)
{
    IfxCpu_enableInterrupts();
#if (SPI_0_USE_DMA == TRUE)
    IfxQspi_SpiMaster_isrDmaTransmit(&g_motorControl.inverter.communication.qspi.spiMasterQspi3tle9180);
#else
    IfxQspi_SpiMaster_isrTransmit(&g_qspi.spiMasterQspi3tle9180);
#endif
}
#endif /* (INTERRUPT_PRIORITY_QSPI3_TX > 0) */

#if (INTERRUPT_PRIORITY_QSPI3_RX > 0)
/* Interrupt service units for QSPI4 Receive
 *
 */
IFX_INTERRUPT(Qspi_Tle9180_RxIsr, 0, INTERRUPT_PRIORITY_QSPI3_RX)
{
    IfxCpu_enableInterrupts();
#if (SPI_0_USE_DMA == TRUE)
    IfxQspi_SpiMaster_isrDmaReceive(&g_motorControl.inverter.communication.qspi.spiMasterQspi3tle9180);
#else
    IfxQspi_SpiMaster_isrReceive(&g_qspi.spiMasterQspi3tle9180);
#endif
}
#endif /* (INTERRUPT_PRIORITY_QSPI3_RX > 0) */

#if (INTERRUPT_PRIORITY_QSPI3_ERR > 0)
/* Interrupt service units for QSPI4 Error
 *
 */
IFX_INTERRUPT(Qspi_Tle9180_ErrIsr, 0, INTERRUPT_PRIORITY_QSPI3_ERR)
{
    IfxCpu_enableInterrupts();
    IfxQspi_SpiMaster_isrError(&g_qspi.spiMasterQspi3tle9180);
}
#endif /* (INTERRUPT_PRIORITY_QSPI3_ERR > 0) */
